//
//  THKDiaryBookVM.m
//  Demo
//
//  Created by Joe.cheng on 2021/8/24.
//

#import "THKDiaryBookVM.h"

@interface THKDiaryBookVM ()

@end

@implementation THKDiaryBookVM

- (void)initialize{
    self.sections = @[@"开工大吉",@"拆除改造",@"施工中",@"未完待续…"];
    self.rows = @[@"8月20日，Day8\n水电改造，自己也不专业，索性把自己的需求和设计提完后按照设计师定的来做就行了，全屋算了一下，大概有100多个开关要买，之前采购的暂时足够用",
                  @"8月20日，Day8\n水电改造，自己也不专业，索性把自己的需求和设计提完后按照设计师定的来做就行了，全屋算了一下，大概有100多个开关要买，之前采购的暂时足够用",
                  @"8月20日，Day8\n水电改造，自己也不专业，索性把自己的需求和设计提完后按照设计师定的来做就行了，全屋算了一下，大概有100多个开关要买，之前采购的暂时足够用",
                  @"8月20日，Day8\n水电改造，自己也不专业，索性把自己的需求和设计提完后按照设计师定的来做就行了，全屋算了一下，大概有100多个开关要买，之前采购的暂时足够用"];
}

@end
